---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.IsBendingRadiusChanged
source: html/b2d9fe7c-8574-cbd1-649b-f85e323c9023.htm
---
# Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.IsBendingRadiusChanged Property

Indicates if the bending radius has changed since the last regeneration.

## Syntax (C#)
```csharp
public bool IsBendingRadiusChanged { get; }
```